Revit 2027 API
BuiltInFailures.StairRampFailures.InvalidBalustersPattern Property
 Invalid Balusters Pattern
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidBalustersPattern { get; }
Public Shared ReadOnly Property InvalidBalustersPattern As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidBalustersPattern {
	FailureDefinitionId^ get ();
}
static member InvalidBalustersPattern : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace